"""
1、有下面几个数据 ，t1 = ("aa",11)      t2= (''bb'',22)    li1 = [("cc",22)]

请通过学过的知识点，进行相关操作变为如下字典: {"aa":11,"cc":22,"bb":22}

2、当前有一个列表 li = [11,22,33,22,22,44,55,77,88,99,11]，
 要求一：去除列表中的重复元素，
 要求二：去重后删除 77，88，99这三个元素
3、利用random函数生成随机整数（范围1-9），然后用户输入一个数字，来进行比较：
如果大于随机数，则打印印大于随机数。
如果小于随机数，则打印小于随机数。
如果相等随机数，则打印等于随机数。
4、一家商场在降价促销。如果购买金额50-100元(包含50元和100元)之间，会给打九折，
如果购买金额大于100元会给打八折。编写一程序，询问购买价格，再打印出折扣和最终价格。
5、提示用户输入一个数（只考虑整数），判断这个数能同时被3和5整除，
能整除打印 :能整除
不能整除打印：不能整除
"""
import random

print("----------------------------第1题----------------------------")
t1 = ("aa", 11)
t2 = ("bb", 22)
li1 = [("cc", 22)]
li1.append(t2)
li1.insert(0, t1)
print(dict(li1))

print("----------------------------第2题----------------------------")
li = [11, 22, 33, 22, 22, 44, 55, 77, 88, 99, 11]
# 要求一：去除列表中的重复元素
print(f"原始列表：{li}")
li2 = list(set(li))
print(f'去重后列表：{li2}')
# 要求二：去重后删除 77，88，99这三个元素
li2.remove(77)
li2.remove(88)
li2.remove(99)
print(f"最终列表：{li2}")

print("----------------------------第3题----------------------------")
random_number = random.randint(1, 9)
input_number = int(input('请随机输入一个数字：'))
print(f'随机数为：{random_number}, 你输入的数为：{input_number}')
if random_number < input_number:
    print('大于随机数')
elif random_number > input_number:
    print('小于随机数')
else:
    print('等于随机数')

print("----------------------------第4题----------------------------")
total = float(input("请输入商品总价："))
if 50 <= total <= 100:
    print("本次购物总额：{:.2f}, 获得折扣金额：{:.2f}, 应付金额：{:.2f}".format(total, total * 0.1, total * 0.9))
elif total > 100:
    print("本次购物总额：{:.2f}, 获得折扣金额：{:.2f}, 应付金额：{:.2f}".format(total, total * 0.2, total * 0.8))

print("----------------------------第5题----------------------------")
number = int(input("请输入1个整数："))
# 判断这个数能否同时被3和5整除
if number % 3 == 0 and number % 5 == 0:
    print("能整除")
else:
    print("不能整除")
